Lingjia007/STM32F407_Bootloader/IAP/menu.c
/**
  ******************************************************************************
  * @file    IAP/IAP_Main/Src/menu.c
  * @author  MCD Application Team

  * @brief   This file provides the software which contains the main menu routine.
  *          The main menu gives the options of:
  *             - downloading a new binary file,
  *             - uploading internal flash memory,
  *             - executing the binary file already loaded
  *             - configuring the write protection of the Flash sectors where the
  *               user loads his binary file.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/** @addtogroup STM32F4xx_IAP_Main
 * @{
 */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "common.h"
#include "flash_if.h"
#include "menu.h"
#include "ymodem.h"
#include "fatfs.h"
#include "lfs_spi_flash_adapter.h"
#include "bootloader_core.h"
#include "lfs.h"
#include "stdio.h"
#include "string.h"
#include "aes_decrypt.h"
#include "hpatch_upgrade.h"
#include "usart.h"
#include "esp8266_driver.h"
#include "esp8266_ota_api.h"
#include "onenet_ota.h"
#include "esp8266_ota_config.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define MAX_FILES 20
#define MAX_FILENAME_LEN 128

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
pFunction JumpToApplication;
uint32_t JumpAddress;
uint32_t FlashProtection = 0;
uint8_t aFileName[FILE_NAME_LENGTH];

static char file_list[MAX_FILES][MAX_FILENAME_LEN];
static uint8_t file_count = 0;

static char hdiff_list[MAX_FILES][MAX_FILENAME_LEN];
static uint8_t hdiff_count = 0;

/* Private function prototypes -----------------------------------------------*/
void SerialDownload(void);
void SerialUpload(void);
void SDCardDownload(void);
void SPIFlashDownload(void);
static void DecryptAESFile(void);
static void DecryptAndDownloadMenu(void);
static void BuildSelectionPrompt(char *msg, size_t msg_size, uint8_t file_count, const char *prefix);
static void scan_sd_card_hdiff_files(void);
static void HPatchUpgradeMenu(void);
static void UART_Passthrough(void);
static void ESP8266_TestMenu(void);

/* Private functions ---------------------------------------------------------*/

static uint8_t check_file_extension(const char *filename)
{
  const char *ext = NULL;
  size_t len = strlen(filename);

  if (len < 4)
  {
    return 0;
  }

  ext = filename + len - 4;
  if (strcmp(ext, ".bin") == 0 || strcmp(ext, ".BIN") == 0)
  {
    return 1;
  }

  if (len >= 6)
  {
    ext = filename + len - 6;
    if (strcmp(ext, ".hdiff") == 0 || strcmp(ext, ".HDIFF") == 0)
    {
      return 2;
    }
  }

  if (len >= 8)
  {
    ext = filename + len - 8;
    if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
    {
      return 1;
    }
  }

  return 0;
}

static void BuildSelectionPrompt(char *msg, size_t msg_size, uint8_t file_count, const char *prefix)
{
  snprintf(msg, msg_size, "%s (1-%d) or 'a' to abort: ", prefix, file_count);
}

static void scan_sd_card_files(void)
{
  DIR dir;
  FILINFO fno;
  FRESULT res;

  file_count = 0;

  res = f_opendir(&dir, "0:/");
  if (res != FR_OK)
  {
    Serial_PutString((uint8_t *)"\r\nError: Cannot open SD card directory!\r\n");
    return;
  }

  while (file_count < MAX_FILES)
  {
    res = f_readdir(&dir, &fno);
    if (res != FR_OK || fno.fname[0] == 0)
    {
      break;
    }

    if (!(fno.fattrib & AM_DIR))
    {
      if (check_file_extension(fno.fname))
      {
        strncpy(file_list[file_count], fno.fname, MAX_FILENAME_LEN - 1);
        file_list[file_count][MAX_FILENAME_LEN - 1] = '\0';
        file_count++;
      }
    }
  }

  f_closedir(&dir);
}

static void scan_sd_card_files_filter(uint8_t filter_type)
{
  DIR dir;
  FILINFO fno;
  FRESULT res;

  file_count = 0;

  res = f_opendir(&dir, "0:/");
  if (res != FR_OK)
  {
    Serial_PutString((uint8_t *)"\r\nError: Cannot open SD card directory!\r\n");
    return;
  }

  while (file_count < MAX_FILES)
  {
    res = f_readdir(&dir, &fno);
    if (res != FR_OK || fno.fname[0] == 0)
    {
      break;
    }

    if (!(fno.fattrib & AM_DIR))
    {
      uint8_t ext_type = check_file_extension(fno.fname);
      if (ext_type == filter_type || (filter_type == 0 && ext_type))
      {
        strncpy(file_list[file_count], fno.fname, MAX_FILENAME_LEN - 1);
        file_list[file_count][MAX_FILENAME_LEN - 1] = '\0';
        file_count++;
      }
    }
  }

  f_closedir(&dir);
}

static void scan_lfs_files(lfs_t *lfs)
{
  lfs_dir_t dir;
  struct lfs_info info;
  int res;

  file_count = 0;

  res = lfs_dir_open(lfs, &dir, "/");
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"\r\nError: Cannot open SPI Flash directory!\r\n");
    return;
  }

  while (file_count < MAX_FILES)
  {
    res = lfs_dir_read(lfs, &dir, &info);
    if (res <= 0)
    {
      break;
    }

    if (info.type == LFS_TYPE_REG)
    {
      if (check_file_extension(info.name))
      {
        strncpy(file_list[file_count], info.name, MAX_FILENAME_LEN - 1);
        file_list[file_count][MAX_FILENAME_LEN - 1] = '\0';
        file_count++;
      }
    }
  }

  lfs_dir_close(lfs, &dir);
}

static void scan_lfs_files_filter(lfs_t *lfs, uint8_t filter_type)
{
  lfs_dir_t dir;
  struct lfs_info info;
  int res;

  file_count = 0;

  res = lfs_dir_open(lfs, &dir, "/");
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"\r\nError: Cannot open SPI Flash directory!\r\n");
    return;
  }

  while (file_count < MAX_FILES)
  {
    res = lfs_dir_read(lfs, &dir, &info);
    if (res <= 0)
    {
      break;
    }

    if (info.type == LFS_TYPE_REG)
    {
      uint8_t ext_type = check_file_extension(info.name);
      if (ext_type == filter_type || (filter_type == 0 && ext_type))
      {
        strncpy(file_list[file_count], info.name, MAX_FILENAME_LEN - 1);
        file_list[file_count][MAX_FILENAME_LEN - 1] = '\0';
        file_count++;
      }
    }
  }

  lfs_dir_close(lfs, &dir);
}

static void scan_lfs_hdiff_files(lfs_t *lfs)
{
  lfs_dir_t dir;
  struct lfs_info info;
  int res;

  hdiff_count = 0;

  res = lfs_dir_open(lfs, &dir, "/");
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"\r\nError: Cannot open SPI Flash directory!\r\n");
    return;
  }

  while (hdiff_count < MAX_FILES)
  {
    res = lfs_dir_read(lfs, &dir, &info);
    if (res <= 0)
    {
      break;
    }

    if (info.type == LFS_TYPE_REG)
    {
      size_t len = strlen(info.name);
      if (len >= 6)
      {
        const char *ext = info.name + len - 6;
        if (strcmp(ext, ".hdiff") == 0 || strcmp(ext, ".HDIFF") == 0)
        {
          strncpy(hdiff_list[hdiff_count], info.name, MAX_FILENAME_LEN - 1);
          hdiff_list[hdiff_count][MAX_FILENAME_LEN - 1] = '\0';
          hdiff_count++;
        }
      }
    }
  }

  lfs_dir_close(lfs, &dir);
}

static void ImageDownloadMenu(void)
{
  uint8_t key = 0;

  while (1)
  {
    Serial_PutString((uint8_t *)"\r\n=================== Image Download Menu =================\r\n\n");
    Serial_PutString((uint8_t *)"  Download via Serial (Ymodem) ------------------------ 1\r\n\n");
    Serial_PutString((uint8_t *)"  Download from SD card (FATFS) ----------------------- 2\r\n\n");
    Serial_PutString((uint8_t *)"  Download from SPI Flash (LittleFS) ------------------ 3\r\n\n");
    Serial_PutString((uint8_t *)"  Return to Main Menu --------------------------------- 0\r\n\n");
    Serial_PutString((uint8_t *)"==========================================================\r\n\n");

    __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    switch (key)
    {
    case '0':
      Serial_PutString((uint8_t *)"\r\nReturn to Main Menu...\r\n");
      return;
    case '1':
      SerialDownload();
      break;
    case '2':
      SDCardDownload();
      break;
    case '3':
      SPIFlashDownload();
      break;
    default:
      Serial_PutString((uint8_t *)"Invalid Number ! ==> The number should be 0, 1, 2 or 3\r");
      break;
    }
  }
}

static void ShowStoredImages(lfs_t *lfs)
{
  lfs_dir_t dir;
  struct lfs_info info;
  int res;
  uint8_t count = 0;
  char msg[128];

