Lingjia007/STM32F407_Bootloader/IAP/menu.c
  Serial_PutString((uint8_t *)"\r\nStored images in SPI Flash:\r\n");
  Serial_PutString((uint8_t *)"========================================\r\n");

  res = lfs_dir_open(lfs, &dir, "/");
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"Error: Cannot open directory!\r\n");
    return;
  }

  while (1)
  {
    res = lfs_dir_read(lfs, &dir, &info);
    if (res <= 0)
    {
      break;
    }

    if (info.type == LFS_TYPE_REG)
    {
      count++;
      snprintf(msg, sizeof(msg), "  [%d] %s  Size: %lu bytes\r\n", count, info.name, (uint32_t)info.size);
      Serial_PutString((uint8_t *)msg);
    }
  }

  lfs_dir_close(lfs, &dir);

  if (count == 0)
  {
    Serial_PutString((uint8_t *)"  No images stored.\r\n");
  }

  Serial_PutString((uint8_t *)"========================================\r\n");
}

static void DeleteStoredImage(lfs_t *lfs)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[128];
  int res;

  scan_lfs_files(lfs);

  if (file_count == 0)
  {
    Serial_PutString((uint8_t *)"\r\nNo images found to delete!\r\n");
    return;
  }

  Serial_PutString((uint8_t *)"\r\nSelect image to delete:\r\n");

  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%d] %s\r\n", i + 1, file_list[i]);
    Serial_PutString((uint8_t *)msg);
  }

  BuildSelectionPrompt(msg, sizeof(msg), file_count, "\r\nEnter selection");
  Serial_PutString((uint8_t *)msg);

  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

  while (1)
  {
    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    if (key == 'a' || key == 'A')
    {
      Serial_PutString((uint8_t *)"\r\nAborted by user.\r\n");
      return;
    }

    if (key >= '1' && key <= '9')
    {
      selected = key - '0';
      if (selected >= 1 && selected <= file_count)
      {
        break;
      }
    }
  }

  snprintf(msg, sizeof(msg), "\r\nDeleting: %s\r\n", file_list[selected - 1]);
  Serial_PutString((uint8_t *)msg);

  res = lfs_remove(lfs, file_list[selected - 1]);
  if (res == LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"Image deleted successfully!\r\n");
  }
  else
  {
    Serial_PutString((uint8_t *)"Error: Failed to delete image!\r\n");
  }
}

static void DeleteEntireFS(lfs_t *lfs)
{
  uint8_t key = 0;
  int res;

  Serial_PutString((uint8_t *)"\r\nWARNING: This will delete ALL files in SPI Flash!\r\n");
  Serial_PutString((uint8_t *)"Press 'y' to confirm, any other key to abort: ");

  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);
  HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

  if (key != 'y' && key != 'Y')
  {
    Serial_PutString((uint8_t *)"\r\nAborted by user.\r\n");
    return;
  }

  Serial_PutString((uint8_t *)"\r\nFormatting SPI Flash file system...\r\n");

  res = lfs_unmount(lfs);
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"Warning: Unmount failed, continuing...\r\n");
  }

  res = lfs_format(lfs, &lfs_spi_flash_cfg);
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"Error: Format failed!\r\n");
    return;
  }

  res = lfs_mount(lfs, &lfs_spi_flash_cfg);
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"Error: Remount failed!\r\n");
    return;
  }

  Serial_PutString((uint8_t *)"File system formatted successfully!\r\n");
}

static void StoreFromTFCard(void)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  int res;
  bootloader_err_t err;
  lfs_t lfs;

  Serial_PutString((uint8_t *)"\r\nInitializing TF card...\r\n");

  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    Serial_PutString((uint8_t *)"Error: SD card mount failed! Error code: ");
    Int2Str((uint8_t *)msg, res);
    Serial_PutString((uint8_t *)msg);
    Serial_PutString((uint8_t *)"\r\n");
    return;
  }

  Serial_PutString((uint8_t *)"Initializing SPI Flash...\r\n");

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    Serial_PutString((uint8_t *)"Error: SPI Flash initialization failed!\r\n");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  Serial_PutString((uint8_t *)"Mounting LittleFS...\r\n");

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"Error: LittleFS mount failed!\r\n");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  Serial_PutString((uint8_t *)"Scanning TF card for bin, aes and hdiff files...\r\n\r\n");

  scan_sd_card_files();

  if (file_count == 0)
  {
    Serial_PutString((uint8_t *)"No bin, aes or hdiff files found on TF card!\r\n");
    lfs_spi_flash_unmount(&lfs);
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  Serial_PutString((uint8_t *)"Found files:\r\n");

  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%d] %s\r\n", i + 1, file_list[i]);
    Serial_PutString((uint8_t *)msg);
  }

  BuildSelectionPrompt(msg, sizeof(msg), file_count, "\r\nSelect file to store");
  Serial_PutString((uint8_t *)msg);

  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

  while (1)
  {
    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    if (key == 'a' || key == 'A')
    {
      Serial_PutString((uint8_t *)"\r\nAborted by user.\r\n");
      lfs_spi_flash_unmount(&lfs);
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }

    if (key >= '1' && key <= '9')
    {
      selected = key - '0';
      if (selected >= 1 && selected <= file_count)
      {
        break;
      }
    }
  }

  snprintf(msg, sizeof(msg), "\r\nSelected: %s\r\n", file_list[selected - 1]);
  Serial_PutString((uint8_t *)msg);

  Serial_PutString((uint8_t *)"\r\nStoring image to SPI Flash...\r\n");

  bootloader_ctx.config.storage.fatfs = &SDFatFS;
  bootloader_ctx.config.storage.lfs = &lfs;
  strncpy(bootloader_ctx.config.storage.fatfs_path, file_list[selected - 1], sizeof(bootloader_ctx.config.storage.fatfs_path) - 1);
  bootloader_ctx.config.storage.fatfs_path[sizeof(bootloader_ctx.config.storage.fatfs_path) - 1] = '\0';
  strncpy(bootloader_ctx.config.storage.lfs_path, file_list[selected - 1], sizeof(bootloader_ctx.config.storage.lfs_path) - 1);
  bootloader_ctx.config.storage.lfs_path[sizeof(bootloader_ctx.config.storage.lfs_path) - 1] = '\0';

  err = bootloader_download(&fatfs_source_if, &lfs_target_if, NULL);

  if (err == BOOTLOADER_OK)
  {
    Serial_PutString((uint8_t *)"\r\nImage stored successfully!\r\n");
  }
  else
  {
    Serial_PutString((uint8_t *)"\r\nStore failed! Error code: ");
    Int2Str((uint8_t *)msg, (uint32_t)(-err));
    Serial_PutString((uint8_t *)msg);
    Serial_PutString((uint8_t *)"\r\n");
  }

  lfs_spi_flash_unmount(&lfs);
  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void StoreFromInternalFlash(void)
{
  uint8_t key = 0;
  char filename[64];
  char msg[256];
  char size_str[16];
  uint8_t idx = 0;
  uint32_t size = 0;
  uint32_t flash_addr;
  uint32_t flash_size;
  int res;
  lfs_t lfs;
  lfs_file_t file;
  uint8_t buffer[256];
  uint32_t bytes_written = 0;
  uint32_t total_written = 0;

  Serial_PutString((uint8_t *)"\r\nInitializing SPI Flash...\r\n");

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    Serial_PutString((uint8_t *)"Error: SPI Flash initialization failed!\r\n");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"Error: LittleFS mount failed!\r\n");
    return;
  }

