Lingjia007/STM32F407_Bootloader/IAP/menu.c
  Serial_PutString((uint8_t *)"\r\nEnter filename (with .bin or .bin.aes extension): ");

  idx = 0;
  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

  while (1)
  {
    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    if (key == '\r' || key == '\n')
    {
      filename[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        Serial_PutString((uint8_t *)"\b \b");
      }
    }
    else if (idx < sizeof(filename) - 1 && key >= 0x20 && key <= 0x7E)
    {
      filename[idx++] = key;
      HAL_UART_Transmit(&UartHandle, &key, 1, HAL_MAX_DELAY);
    }
  }

  if (idx == 0)
  {
    Serial_PutString((uint8_t *)"\r\nError: Empty filename!\r\n");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  if (!check_file_extension(filename))
  {
    Serial_PutString((uint8_t *)"\r\nError: Invalid file extension! Must be .bin or .bin.aes\r\n");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  Serial_PutString((uint8_t *)"\r\nEnter size in bytes (or 'm' for max): ");

  idx = 0;
  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

  while (1)
  {
    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    if (key == '\r' || key == '\n')
    {
      size_str[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        Serial_PutString((uint8_t *)"\b \b");
      }
    }
    else if (idx < sizeof(size_str) - 1)
    {
      if ((key >= '0' && key <= '9') || (idx == 0 && (key == 'm' || key == 'M')))
      {
        size_str[idx++] = key;
        HAL_UART_Transmit(&UartHandle, &key, 1, HAL_MAX_DELAY);
      }
    }
  }

  if (idx == 0)
  {
    Serial_PutString((uint8_t *)"\r\nError: Empty size!\r\n");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  if (size_str[0] == 'm' || size_str[0] == 'M')
  {
    size = USER_FLASH_SIZE;
  }
  else
  {
    size = 0;
    for (idx = 0; size_str[idx] != '\0'; idx++)
    {
      if (size_str[idx] >= '0' && size_str[idx] <= '9')
      {
        size = size * 10 + (size_str[idx] - '0');
      }
    }
  }

  if (size == 0 || size > USER_FLASH_SIZE)
  {
    Serial_PutString((uint8_t *)"\r\nError: Invalid size!\r\n");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  snprintf(msg, sizeof(msg), "\r\nFilename: %s, Size: %lu bytes\r\n", filename, size);
  Serial_PutString((uint8_t *)msg);

  Serial_PutString((uint8_t *)"Confirm? (y/n): ");

  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);
  HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

  if (key != 'y' && key != 'Y')
  {
    Serial_PutString((uint8_t *)"\r\nAborted by user.\r\n");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  Serial_PutString((uint8_t *)"\r\nStoring from Internal Flash to SPI Flash...\r\n");

  res = lfs_file_open(&lfs, &file, filename, LFS_O_WRONLY | LFS_O_CREAT | LFS_O_TRUNC);
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"Error: Cannot create file!\r\n");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  flash_addr = APPLICATION_ADDRESS;
  flash_size = size;

  while (total_written < flash_size)
  {
    uint32_t to_write = sizeof(buffer);
    if (flash_size - total_written < to_write)
    {
      to_write = flash_size - total_written;
    }

    memcpy(buffer, (uint8_t *)(flash_addr + total_written), to_write);

    bytes_written = lfs_file_write(&lfs, &file, buffer, to_write);
    if (bytes_written != to_write)
    {
      Serial_PutString((uint8_t *)"Error: Write failed!\r\n");
      lfs_file_close(&lfs, &file);
      lfs_spi_flash_unmount(&lfs);
      return;
    }

    total_written += to_write;

    if ((total_written % 4096) == 0 || total_written == flash_size)
    {
      snprintf(msg, sizeof(msg), "Progress: %lu / %lu bytes\r", total_written, flash_size);
      Serial_PutString((uint8_t *)msg);
    }
  }

  lfs_file_close(&lfs, &file);
  lfs_spi_flash_unmount(&lfs);

  Serial_PutString((uint8_t *)"\r\nImage stored successfully!\r\n");
}

static void StoreImageMenu(void)
{
  uint8_t key = 0;
  lfs_t lfs;
  int res;

  while (1)
  {
    Serial_PutString((uint8_t *)"\r\n============== Store Image Menu ==============\r\n\n");
    Serial_PutString((uint8_t *)"  Store image from TF card ------------ 1\r\n\n");
    Serial_PutString((uint8_t *)"  Store image from Flash -------------- 2\r\n\n");
    Serial_PutString((uint8_t *)"  Show stored images ------------------ 3\r\n\n");
    Serial_PutString((uint8_t *)"  Delete stored image ----------------- 4\r\n\n");
    Serial_PutString((uint8_t *)"  Delete entire file system ----------- 5\r\n\n");
    Serial_PutString((uint8_t *)"  Return to main menu ----------------- 0\r\n\n");
    Serial_PutString((uint8_t *)"==============================================\r\n\n");

    __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    switch (key)
    {
    case '0':
      Serial_PutString((uint8_t *)"\r\nReturn to Main Menu...\r\n");
      return;
    case '1':
      StoreFromTFCard();
      break;
    case '2':
      StoreFromInternalFlash();
      break;
    case '3':
      res = lfs_spi_flash_init();
      if (res == 0)
      {
        res = lfs_spi_flash_mount(&lfs);
        if (res == LFS_ERR_OK)
        {
          ShowStoredImages(&lfs);
          lfs_spi_flash_unmount(&lfs);
        }
        else
        {
          Serial_PutString((uint8_t *)"\r\nError: Cannot mount SPI Flash!\r\n");
        }
      }
      else
      {
        Serial_PutString((uint8_t *)"\r\nError: SPI Flash init failed!\r\n");
      }
      break;
    case '4':
      res = lfs_spi_flash_init();
      if (res == 0)
      {
        res = lfs_spi_flash_mount(&lfs);
        if (res == LFS_ERR_OK)
        {
          DeleteStoredImage(&lfs);
          lfs_spi_flash_unmount(&lfs);
        }
        else
        {
          Serial_PutString((uint8_t *)"\r\nError: Cannot mount SPI Flash!\r\n");
        }
      }
      else
      {
        Serial_PutString((uint8_t *)"\r\nError: SPI Flash init failed!\r\n");
      }
      break;
    case '5':
      res = lfs_spi_flash_init();
      if (res == 0)
      {
        res = lfs_spi_flash_mount(&lfs);
        if (res == LFS_ERR_OK)
        {
          DeleteEntireFS(&lfs);
          lfs_spi_flash_unmount(&lfs);
        }
        else
        {
          Serial_PutString((uint8_t *)"\r\nError: Cannot mount SPI Flash!\r\n");
        }
      }
      else
      {
        Serial_PutString((uint8_t *)"\r\nError: SPI Flash init failed!\r\n");
      }
      break;
    default:
      Serial_PutString((uint8_t *)"Invalid Number ! ==> The number should be 0-5\r");
      break;
    }
  }
}

void SDCardDownload(void)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[128];
  FRESULT res;
  bootloader_err_t err;

  Serial_PutString((uint8_t *)"\r\nInitializing TF card...\r\n");

