Lingjia007/STM32F407_Bootloader/IAP/menu.c
    switch (patch_result)
    {
    case HPATCH_ERR_MOUNT:
      Serial_PutString((uint8_t *)"Detail: SD card mount error\r\n");
      break;
    case HPATCH_ERR_OPEN_DIFF:
      Serial_PutString((uint8_t *)"Detail: Cannot open .hdiff file\r\n");
      break;
    case HPATCH_ERR_OPEN_OLD:
      Serial_PutString((uint8_t *)"Detail: Cannot open old firmware file\r\n");
      break;
    case HPATCH_ERR_OPEN_OUT:
      Serial_PutString((uint8_t *)"Detail: Cannot create output file\r\n");
      break;
    case HPATCH_ERR_READ_DIFF:
      Serial_PutString((uint8_t *)"Detail: Error reading diff data\r\n");
      break;
    case HPATCH_ERR_READ_OLD:
      Serial_PutString((uint8_t *)"Detail: Error reading old firmware\r\n");
      break;
    case HPATCH_ERR_WRITE:
      Serial_PutString((uint8_t *)"Detail: Error writing output\r\n");
      break;
    case HPATCH_ERR_DECOMPRESS:
      Serial_PutString((uint8_t *)"Detail: Decompression error\r\n");
      break;
    case HPATCH_ERR_PATCH:
      Serial_PutString((uint8_t *)"Detail: Patch application error\r\n");
      break;
    case HPATCH_ERR_INVALID_HEAD:
      Serial_PutString((uint8_t *)"Detail: Invalid diff file header\r\n");
      break;
    case HPATCH_ERR_MEMORY:
      Serial_PutString((uint8_t *)"Detail: Insufficient memory\r\n");
      break;
    default:
      Serial_PutString((uint8_t *)"Detail: Unknown error\r\n");
      break;
    }
  }

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void HPatchUpgradeLFS(void)
{
  uint8_t key = 0;
  uint8_t selected_diff = 0;
  uint8_t selected_old = 0;
  uint8_t i;
  char msg[256];
  int res;
  lfs_t lfs;
  hpatch_upgrade_err_t patch_result;
  hpatch_lfs_config_t config;
  char out_path[HPATCH_MAX_PATH_LEN];
  char *dot_pos;
  const char *upgrade_tag = "_HdiffUpgraded";

  Serial_PutString((uint8_t *)"\r\nInitializing SPI Flash...\r\n");

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    Serial_PutString((uint8_t *)"Error: SPI Flash initialization failed!\r\n");
    return;
  }

  Serial_PutString((uint8_t *)"Mounting LittleFS...\r\n");

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    Serial_PutString((uint8_t *)"Error: LittleFS mount failed!\r\n");
    return;
  }

  Serial_PutString((uint8_t *)"\r\nScanning for .hdiff files...\r\n\r\n");

  scan_lfs_hdiff_files(&lfs);

  if (hdiff_count == 0)
  {
    Serial_PutString((uint8_t *)"No .hdiff files found on SPI Flash!\r\n");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  Serial_PutString((uint8_t *)"Found .hdiff files:\r\n");

  for (i = 0; i < hdiff_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%d] %s\r\n", i + 1, hdiff_list[i]);
    Serial_PutString((uint8_t *)msg);
  }

  BuildSelectionPrompt(msg, sizeof(msg), hdiff_count, "\r\nSelect .hdiff file");
  Serial_PutString((uint8_t *)msg);

  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

  while (1)
  {
    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    if (key == 'a' || key == 'A')
    {
      Serial_PutString((uint8_t *)"\r\nAborted by user.\r\n");
      lfs_spi_flash_unmount(&lfs);
      return;
    }

    if (key >= '1' && key <= '9')
    {
      selected_diff = key - '0';
      if (selected_diff >= 1 && selected_diff <= hdiff_count)
      {
        break;
      }
    }
  }

  snprintf(msg, sizeof(msg), "\r\nSelected: %s\r\n", hdiff_list[selected_diff - 1]);
  Serial_PutString((uint8_t *)msg);

  Serial_PutString((uint8_t *)"\r\nScanning for .bin firmware files...\r\n\r\n");

  scan_lfs_files_filter(&lfs, 1);

  if (file_count == 0)
  {
    Serial_PutString((uint8_t *)"No .bin files found on SPI Flash!\r\n");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  Serial_PutString((uint8_t *)"Found firmware files:\r\n");

  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%d] %s\r\n", i + 1, file_list[i]);
    Serial_PutString((uint8_t *)msg);
  }

  BuildSelectionPrompt(msg, sizeof(msg), file_count, "\r\nSelect old firmware file to update");
  Serial_PutString((uint8_t *)msg);

  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

  while (1)
  {
    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    if (key == 'a' || key == 'A')
    {
      Serial_PutString((uint8_t *)"\r\nAborted by user.\r\n");
      lfs_spi_flash_unmount(&lfs);
      return;
    }

    if (key >= '1' && key <= '9')
    {
      selected_old = key - '0';
      if (selected_old >= 1 && selected_old <= file_count)
      {
        break;
      }
    }
  }

  snprintf(msg, sizeof(msg), "\r\nSelected: %s\r\n", file_list[selected_old - 1]);
  Serial_PutString((uint8_t *)msg);

  strncpy(out_path, file_list[selected_old - 1], sizeof(out_path) - 1);
  out_path[sizeof(out_path) - 1] = '\0';

  dot_pos = strrchr(out_path, '.');
  if (dot_pos != NULL)
  {
    size_t base_len = dot_pos - out_path;
    if (base_len + strlen(upgrade_tag) + 4 < sizeof(out_path))
    {
      snprintf(dot_pos, sizeof(out_path) - base_len, "%s.bin", upgrade_tag);
    }
    else
    {
      strncat(out_path, upgrade_tag, sizeof(out_path) - strlen(out_path) - 1);
    }
  }
  else
  {
    strncat(out_path, upgrade_tag, sizeof(out_path) - strlen(out_path) - 1);
    strncat(out_path, ".bin", sizeof(out_path) - strlen(out_path) - 1);
  }

  config.lfs = &lfs;
  config.diff_path = hdiff_list[selected_diff - 1];
  config.old_path = file_list[selected_old - 1];
  config.out_path = out_path;

  snprintf(msg, sizeof(msg), "\r\nDiff file: %s\r\n", config.diff_path);
  Serial_PutString((uint8_t *)msg);
  snprintf(msg, sizeof(msg), "Old firmware: %s\r\n", config.old_path);
  Serial_PutString((uint8_t *)msg);
  snprintf(msg, sizeof(msg), "Output file: %s\r\n", config.out_path);
  Serial_PutString((uint8_t *)msg);

  Serial_PutString((uint8_t *)"\r\nStarting HPatch differential upgrade...\r\n");

  patch_result = hpatch_upgrade_lfs(&config);

  if (patch_result == HPATCH_OK)
  {
    Serial_PutString((uint8_t *)"\r\nHPatch upgrade completed successfully!\r\n");
    Serial_PutString((uint8_t *)"Upgraded firmware saved to SPI Flash.\r\n");
    snprintf(msg, sizeof(msg), "Output: %s\r\n", config.out_path);
    Serial_PutString((uint8_t *)msg);
  }
  else
  {
    Serial_PutString((uint8_t *)"\r\nHPatch upgrade failed! Error code: ");
    Int2Str((uint8_t *)msg, (uint32_t)(-patch_result));
    Serial_PutString((uint8_t *)msg);
    Serial_PutString((uint8_t *)"\r\n");

