Lingjia007/STM32F407_Bootloader/IAP/menu.c
    switch (patch_result)
    {
    case HPATCH_ERR_OPEN_DIFF:
      Serial_PutString((uint8_t *)"Detail: Cannot open .hdiff file\r\n");
      break;
    case HPATCH_ERR_OPEN_OLD:
      Serial_PutString((uint8_t *)"Detail: Cannot open old firmware file\r\n");
      break;
    case HPATCH_ERR_OPEN_OUT:
      Serial_PutString((uint8_t *)"Detail: Cannot create output file\r\n");
      break;
    case HPATCH_ERR_READ_DIFF:
      Serial_PutString((uint8_t *)"Detail: Error reading diff data\r\n");
      break;
    case HPATCH_ERR_READ_OLD:
      Serial_PutString((uint8_t *)"Detail: Error reading old firmware\r\n");
      break;
    case HPATCH_ERR_WRITE:
      Serial_PutString((uint8_t *)"Detail: Error writing output\r\n");
      break;
    case HPATCH_ERR_DECOMPRESS:
      Serial_PutString((uint8_t *)"Detail: Decompression error\r\n");
      break;
    case HPATCH_ERR_PATCH:
      Serial_PutString((uint8_t *)"Detail: Patch application error\r\n");
      break;
    case HPATCH_ERR_INVALID_HEAD:
      Serial_PutString((uint8_t *)"Detail: Invalid diff file header\r\n");
      break;
    case HPATCH_ERR_MEMORY:
      Serial_PutString((uint8_t *)"Detail: Insufficient memory\r\n");
      break;
    default:
      Serial_PutString((uint8_t *)"Detail: Unknown error\r\n");
      break;
    }
  }

  lfs_spi_flash_unmount(&lfs);
}

static void HPatchUpgradeMenu(void)
{
  uint8_t key = 0;

  while (1)
  {
    Serial_PutString((uint8_t *)"\r\n============== HPatch Differential Upgrade Menu ==============\r\n\n");
    Serial_PutString((uint8_t *)"  HPatch upgrade from SD card -------------------------- 1\r\n\n");
    Serial_PutString((uint8_t *)"  HPatch upgrade from SPI Flash ------------------------ 2\r\n\n");
    Serial_PutString((uint8_t *)"  Return to Main Menu ---------------------------------- 0\r\n\n");
    Serial_PutString((uint8_t *)"===============================================================\r\n\n");

    __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    switch (key)
    {
    case '0':
      Serial_PutString((uint8_t *)"\r\nReturn to Main Menu...\r\n");
      return;
    case '1':
      HPatchUpgradeSDCard();
      break;
    case '2':
      HPatchUpgradeLFS();
      break;
    default:
      Serial_PutString((uint8_t *)"Invalid Number ! ==> The number should be 0, 1 or 2\r");
      break;
    }
  }
}

static void UART_Passthrough(void)
{
  uint8_t rx_data;
  uint8_t q_count = 0;
  uint32_t q_timer = 0;

  Serial_PutString((uint8_t *)"\r\n========== UART4 <-> USART1 Passthrough Mode ==========\r\n");
  Serial_PutString((uint8_t *)"  UART4 (PA0/PA1) <--> USART1 (PA9/PA10)\r\n");
  Serial_PutString((uint8_t *)"  Baud Rate: 115200, 8N1\r\n");
  Serial_PutString((uint8_t *)"  For ESP8266/BLE AT Command Debug\r\n");
  Serial_PutString((uint8_t *)"  Press 'q' 3 times within 1 second to exit\r\n");
  Serial_PutString((uint8_t *)"========================================================\r\n\n");

  __HAL_UART_FLUSH_DRREGISTER(&huart4);
  __HAL_UART_FLUSH_DRREGISTER(&huart1);

  __HAL_UART_CLEAR_OREFLAG(&huart4);
  __HAL_UART_CLEAR_OREFLAG(&huart1);

  while (1)
  {
    if ((huart4.Instance->SR & UART_FLAG_RXNE) != RESET)
    {
      rx_data = (uint8_t)(huart4.Instance->DR & 0xFF);

      if (rx_data == 'q')
      {
        if (q_count == 0 || (HAL_GetTick() - q_timer) < 1000)
        {
          q_count++;
          q_timer = HAL_GetTick();
          if (q_count >= 3)
          {
            Serial_PutString((uint8_t *)"\r\n\nExiting passthrough mode...\r\n");
            return;
          }
        }
        else
        {
          q_count = 1;
          q_timer = HAL_GetTick();
        }
      }
      else
      {
        q_count = 0;
      }

      while ((huart1.Instance->SR & UART_FLAG_TXE) == RESET)
        ;
      huart1.Instance->DR = rx_data;
    }
    else if ((huart4.Instance->SR & UART_FLAG_ORE) != RESET)
    {
      __HAL_UART_CLEAR_OREFLAG(&huart4);
    }

    if ((huart1.Instance->SR & UART_FLAG_RXNE) != RESET)
    {
      rx_data = (uint8_t)(huart1.Instance->DR & 0xFF);
      while ((huart4.Instance->SR & UART_FLAG_TXE) == RESET)
        ;
      huart4.Instance->DR = rx_data;
    }
    else if ((huart1.Instance->SR & UART_FLAG_ORE) != RESET)
    {
      __HAL_UART_CLEAR_OREFLAG(&huart1);
    }
  }
}

static void ESP8266_TestMenu(void)
{
  uint8_t key = 0;
  static char ip_buf[16] = {0};
  static uint8_t wifi_initialized = 0;
  char msg[128];

  while (1)
  {
    Serial_PutString((uint8_t *)"\r\n============== ESP8266 Test Menu ==============\r\n\n");
    Serial_PutString((uint8_t *)"  WiFi Init & Connect AP  ---------------------------- 1\r\n\n");
    Serial_PutString((uint8_t *)"  AT Command Test  ----------------------------------- 2\r\n\n");
    Serial_PutString((uint8_t *)"  TCP Connect Test  ---------------------------------- 3\r\n\n");
    Serial_PutString((uint8_t *)"  Enter Transparent Mode  ---------------------------- 4\r\n\n");
    Serial_PutString((uint8_t *)"  Exit Transparent Mode  ----------------------------- 5\r\n\n");
    Serial_PutString((uint8_t *)"  OneNET OTA Check  ---------------------------------- 6\r\n\n");
    Serial_PutString((uint8_t *)"  Show WiFi Status  ---------------------------------- 7\r\n\n");
    Serial_PutString((uint8_t *)"  Return to Main Menu  ------------------------------- 0\r\n\n");
    Serial_PutString((uint8_t *)"================================================\r\n\n");

    __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    switch (key)
    {
    case '0':
      Serial_PutString((uint8_t *)"\r\nReturn to Main Menu...\r\n");
      return;

    case '1':
      Serial_PutString((uint8_t *)"\r\nInitializing ESP8266 and connecting to AP...\r\n");
      esp8266_ota_init();
      wifi_initialized = 1;
      snprintf(msg, sizeof(msg), "IP: %s\r\n", ip_buf);
      Serial_PutString((uint8_t *)msg);
      break;

    case '2':
      Serial_PutString((uint8_t *)"\r\nTesting AT command...\r\n");
      if (esp8266_at_test() == ESP8266_EOK)
      {
        Serial_PutString((uint8_t *)"AT test OK!\r\n");
      }
      else
      {
        Serial_PutString((uint8_t *)"AT test FAILED!\r\n");
      }
      break;

