Lingjia007/STM32F407_Bootloader/IAP/menu.c
    case '3':
    {
      char server_ip[64];
      char server_port[8];
      uint8_t idx = 0;

      Serial_PutString((uint8_t *)"\r\nEnter server IP: ");
      idx = 0;
      __HAL_UART_FLUSH_DRREGISTER(&UartHandle);
      while (1)
      {
        HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);
        if (key == '\r' || key == '\n')
        {
          server_ip[idx] = '\0';
          break;
        }
        else if (key == 0x08 || key == 0x7F)
        {
          if (idx > 0)
          {
            idx--;
            Serial_PutString((uint8_t *)"\b \b");
          }
        }
        else if (idx < sizeof(server_ip) - 1 && key >= 0x20 && key <= 0x7E)
        {
          server_ip[idx++] = key;
          HAL_UART_Transmit(&UartHandle, &key, 1, HAL_MAX_DELAY);
        }
      }

      Serial_PutString((uint8_t *)"\r\nEnter server port: ");
      idx = 0;
      __HAL_UART_FLUSH_DRREGISTER(&UartHandle);
      while (1)
      {
        HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);
        if (key == '\r' || key == '\n')
        {
          server_port[idx] = '\0';
          break;
        }
        else if (key == 0x08 || key == 0x7F)
        {
          if (idx > 0)
          {
            idx--;
            Serial_PutString((uint8_t *)"\b \b");
          }
        }
        else if (idx < sizeof(server_port) - 1 && key >= '0' && key <= '9')
        {
          server_port[idx++] = key;
          HAL_UART_Transmit(&UartHandle, &key, 1, HAL_MAX_DELAY);
        }
      }

      snprintf(msg, sizeof(msg), "\r\nConnecting to %s:%s...\r\n", server_ip, server_port);
      Serial_PutString((uint8_t *)msg);

      if (esp8266_connect_tcp_server(server_ip, server_port) == ESP8266_EOK)
      {
        Serial_PutString((uint8_t *)"TCP connect OK!\r\n");
      }
      else
      {
        Serial_PutString((uint8_t *)"TCP connect FAILED!\r\n");
      }
      break;
    }

    case '4':
      Serial_PutString((uint8_t *)"\r\nEntering transparent mode...\r\n");
      if (esp8266_enter_unvarnished() == ESP8266_EOK)
      {
        Serial_PutString((uint8_t *)"Transparent mode enabled!\r\n");
        Serial_PutString((uint8_t *)"You can now send data directly.\r\n");
      }
      else
      {
        Serial_PutString((uint8_t *)"Enter transparent mode FAILED!\r\n");
      }
      break;

    case '5':
      Serial_PutString((uint8_t *)"\r\nExiting transparent mode...\r\n");
      esp8266_exit_unvarnished();
      Serial_PutString((uint8_t *)"Transparent mode exited.\r\n");
      break;

    case '6':
      Serial_PutString((uint8_t *)"\r\nChecking OneNET OTA...\r\n");
      ONENET_OTA_ProcessUpgrade();
      break;

    case '7':
      Serial_PutString((uint8_t *)"\r\nWiFi Status:\r\n");
      if (wifi_initialized)
      {
        snprintf(msg, sizeof(msg), "  Status: Connected\r\n");
        snprintf(msg + strlen(msg), sizeof(msg) - strlen(msg), "  IP: %s\r\n", ip_buf);
      }
      else
      {
        snprintf(msg, sizeof(msg), "  Status: Not initialized\r\n");
      }
      Serial_PutString((uint8_t *)msg);
      break;

    default:
      Serial_PutString((uint8_t *)"Invalid Number! ==> The number should be 0-7\r");
      break;
    }
  }
}

/**
 * @brief  Display the Main Menu on HyperTerminal
 * @param  None
 * @retval None
 */
void Main_Menu(void)
{
  uint8_t key = 0;

  Serial_PutString((uint8_t *)"\r\n======================================================================");
  Serial_PutString((uint8_t *)"\r\n=              (C) COPYRIGHT 2016 STMicroelectronics                 =");
  Serial_PutString((uint8_t *)"\r\n=                                                                    =");
  Serial_PutString((uint8_t *)"\r\n=          STM32F4xx In-Application Programming Application          =");
  Serial_PutString((uint8_t *)"\r\n=                                                                    =");
  Serial_PutString((uint8_t *)"\r\n=                       By MCD Application Team                      =");
  Serial_PutString((uint8_t *)"\r\n======================================================================");
  Serial_PutString((uint8_t *)"\r\n\r\n");

  while (1)
  {

    /* Test if any sector of Flash memory where user application will be loaded is write protected */
    FlashProtection = FLASH_If_GetWriteProtectionStatus();

    Serial_PutString((uint8_t *)"\r\n=================== Main Menu ============================\r\n\n");
    Serial_PutString((uint8_t *)"  Download image to internal Flash  -------------------- 1\r\n\n");
    Serial_PutString((uint8_t *)"  Upload image from internal Flash  -------------------- 2\r\n\n");
    Serial_PutString((uint8_t *)"  Store image to SPI-Flash LFS  ------------------------ 3\r\n\n");
    Serial_PutString((uint8_t *)"  Execute the loaded application  ---------------------- 4\r\n\n");

    if (FlashProtection != FLASHIF_PROTECTION_NONE)
    {
      Serial_PutString((uint8_t *)"  Disable Flash write protection  ---------------------- 5\r\n\n");
    }
    else
    {
      Serial_PutString((uint8_t *)"  Enable Flash write protection  ----------------------- 5\r\n\n");
    }

    Serial_PutString((uint8_t *)"  Decrypt and download encrypted firmware  ------------- 6\r\n\n");
    Serial_PutString((uint8_t *)"  Decrypt .bin.aes file on SD card  -------------------- 7\r\n\n");
    Serial_PutString((uint8_t *)"  HPatch differential upgrade  ------------------------- 8\r\n\n");
    Serial_PutString((uint8_t *)"  UART4 <-> USART1 Passthrough  ------------------------ 9\r\n\n");
    Serial_PutString((uint8_t *)"  ESP8266 WiFi & OTA Test  ----------------------------- a\r\n\n");

    Serial_PutString((uint8_t *)"==========================================================\r\n\n");

    /* Clean the input path */
    __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

    /* Receive key */
    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    switch (key)
    {
    case '1':
      ImageDownloadMenu();
      break;
    case '2':
      SerialUpload();
      break;
    case '3':
      StoreImageMenu();
      break;
    case '4':
      Serial_PutString((uint8_t *)"Start program execution......\r\n\n");
      bootloader_ctx.config.jump.jump_func(bootloader_ctx.config.jump.app_jump_addr);
      break;
    case '5':
      if (FlashProtection != FLASHIF_PROTECTION_NONE)
      {
        if (FLASH_If_WriteProtectionConfig(OB_WRPSTATE_DISABLE) == HAL_OK)
        {
          Serial_PutString((uint8_t *)"Write Protection disabled...\r\n");
          Serial_PutString((uint8_t *)"System will now restart...\r\n");
          HAL_FLASH_OB_Launch();
          HAL_FLASH_Unlock();
        }
        else
        {
          Serial_PutString((uint8_t *)"Error: Flash write un-protection failed...\r\n");
        }
      }
      else
      {
        if (FLASH_If_WriteProtectionConfig(OB_WRPSTATE_ENABLE) == HAL_OK)
        {
          Serial_PutString((uint8_t *)"Write Protection enabled...\r\n");
          Serial_PutString((uint8_t *)"System will now restart...\r\n");
          HAL_FLASH_OB_Launch();
        }
        else
        {
          Serial_PutString((uint8_t *)"Error: Flash write protection failed...\r\n");
        }
      }
      break;
    case '6':
      DecryptAndDownloadMenu();
      break;
    case '7':
      DecryptAESFile();
      break;
    case '8':
      HPatchUpgradeMenu();
      break;
    case '9':
      UART_Passthrough();
      break;
    case 'a':
    case 'A':
      ESP8266_TestMenu();
      break;
    default:
      Serial_PutString((uint8_t *)"Invalid Number ! ==> The number should be 1-9 or a\r");
      break;
    }
  }
}

