Lingjia007/STM32F407_Bootloader/IAP/menu.c
static void DecryptAESFile(void)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  FRESULT res;
  int decrypt_result;
  char src_path[128];
  char dst_path[128];
  char *dot_pos;
  aes_decrypt_config_t decrypt_config = {
      .key = {0x8f, 0x8b, 0x6e, 0xcb, 0x07, 0x78, 0xa9, 0xb7,
              0x10, 0x97, 0x94, 0xb6, 0xe2, 0x31, 0xcd, 0xf3,
              0xc3, 0x40, 0x2e, 0x1d, 0x4f, 0x2a, 0xa3, 0x14,
              0xe0, 0x56, 0x60, 0x16, 0xac, 0xe4, 0x5c, 0xe0},
      .iv = {0xc1, 0xb7, 0x95, 0x2d, 0x38, 0xe6, 0x0e, 0xbd,
             0x33, 0x30, 0x6d, 0xdf, 0x49, 0x2b, 0x7a, 0x58}};

  Serial_PutString((uint8_t *)"\r\nInitializing TF card...\r\n");

  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    Serial_PutString((uint8_t *)"Error: SD card mount failed! Error code: ");
    Int2Str((uint8_t *)msg, res);
    Serial_PutString((uint8_t *)msg);
    Serial_PutString((uint8_t *)"\r\n");
    return;
  }

  Serial_PutString((uint8_t *)"Scanning for .bin.aes files...\r\n\r\n");

  scan_sd_card_files();

  uint8_t aes_file_count = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        snprintf(msg, sizeof(msg), "  [%d] %s\r\n", aes_file_count + 1, file_list[i]);
        Serial_PutString((uint8_t *)msg);
        aes_file_count++;
      }
    }
  }

  if (aes_file_count == 0)
  {
    Serial_PutString((uint8_t *)"No .bin.aes files found on SD card!\r\n");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  BuildSelectionPrompt(msg, sizeof(msg), aes_file_count, "\r\nPlease select a file to decrypt");
  Serial_PutString((uint8_t *)msg);

  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

  while (1)
  {
    HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

    if (key == 'a' || key == 'A')
    {
      Serial_PutString((uint8_t *)"\r\nAborted by user.\r\n");
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }

    if (key >= '1' && key <= '9')
    {
      selected = key - '0';
      if (selected >= 1 && selected <= aes_file_count)
      {
        break;
      }
    }
  }

  uint8_t aes_idx = 0;
  for (i = 0; i < file_count; i++)
  {
    size_t len = strlen(file_list[i]);
    if (len >= 8)
    {
      const char *ext = file_list[i] + len - 8;
      if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
      {
        aes_idx++;
        if (aes_idx == selected)
        {
          selected = i;
          break;
        }
      }
    }
  }

  snprintf(msg, sizeof(msg), "\r\nSelected: %s\r\n", file_list[selected]);
  Serial_PutString((uint8_t *)msg);

  snprintf(src_path, sizeof(src_path), "0:/%s", file_list[selected]);

  strncpy(dst_path, src_path, sizeof(dst_path) - 1);
  dst_path[sizeof(dst_path) - 1] = '\0';

  dot_pos = strstr(dst_path, ".bin.aes");
  if (dot_pos == NULL)
  {
    dot_pos = strstr(dst_path, ".BIN.AES");
  }

  if (dot_pos != NULL)
  {
    *dot_pos = '\0';
    strcat(dst_path, ".bin");
  }
  else
  {
    strcat(dst_path, ".decrypted");
  }

  snprintf(msg, sizeof(msg), "Output file: %s\r\n", dst_path);
  Serial_PutString((uint8_t *)msg);

  Serial_PutString((uint8_t *)"\r\nStarting decryption...\r\n");

  decrypt_result = aes_decrypt_file_fatfs(&SDFatFS, src_path, dst_path, &decrypt_config);

  if (decrypt_result > 0)
  {
    Serial_PutString((uint8_t *)"\r\nDecryption completed successfully!\r\n");
    snprintf(msg, sizeof(msg), "Decrypted size: %d bytes\r\n", decrypt_result);
    Serial_PutString((uint8_t *)msg);
    Serial_PutString((uint8_t *)"Output file saved to SD card.\r\n");
  }
  else
  {
    Serial_PutString((uint8_t *)"\r\nDecryption failed! Error code: ");
    Int2Str((uint8_t *)msg, (uint32_t)(-decrypt_result));
    Serial_PutString((uint8_t *)msg);
    Serial_PutString((uint8_t *)"\r\n");
  }

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void DecryptAndDownloadMenu(void)
{
  uint8_t key = 0;
  uint8_t selected = 0;
  uint8_t i;
  char msg[256];
  FRESULT res;
  int decrypt_result;
  char src_path[128];
  int lfs_res;
  lfs_t lfs;
  aes_decrypt_config_t decrypt_config = {
      .key = {0x8f, 0x8b, 0x6e, 0xcb, 0x07, 0x78, 0xa9, 0xb7,
              0x10, 0x97, 0x94, 0xb6, 0xe2, 0x31, 0xcd, 0xf3,
              0xc3, 0x40, 0x2e, 0x1d, 0x4f, 0x2a, 0xa3, 0x14,
              0xe0, 0x56, 0x60, 0x16, 0xac, 0xe4, 0x5c, 0xe0},
      .iv = {0xc1, 0xb7, 0x95, 0x2d, 0x38, 0xe6, 0x0e, 0xbd,
             0x33, 0x30, 0x6d, 0xdf, 0x49, 0x2b, 0x7a, 0x58}};

  Serial_PutString((uint8_t *)"\r\n============== Decrypt and Download Menu =================\r\n\n");
  Serial_PutString((uint8_t *)"  Decrypt from SD card and download to Flash ----------- 1\r\n\n");
  Serial_PutString((uint8_t *)"  Decrypt from SPI Flash and download to Flash --------- 2\r\n\n");
  Serial_PutString((uint8_t *)"  Return to Main Menu ---------------------------------- 0\r\n\n");
  Serial_PutString((uint8_t *)"===========================================================\r\n\n");

  __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

  HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

  switch (key)
  {
  case '0':
    Serial_PutString((uint8_t *)"\r\nReturn to Main Menu...\r\n");
    return;

  case '1':
  {
    Serial_PutString((uint8_t *)"\r\nInitializing TF card...\r\n");

    res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
    if (res != FR_OK)
    {
      Serial_PutString((uint8_t *)"Error: SD card mount failed! Error code: ");
      Int2Str((uint8_t *)msg, res);
      Serial_PutString((uint8_t *)msg);
      Serial_PutString((uint8_t *)"\r\n");
      return;
    }

    Serial_PutString((uint8_t *)"Scanning for .bin.aes files...\r\n\r\n");

    scan_sd_card_files();

    uint8_t aes_file_count = 0;
    for (i = 0; i < file_count; i++)
    {
      size_t len = strlen(file_list[i]);
      if (len >= 8)
      {
        const char *ext = file_list[i] + len - 8;
        if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
        {
          snprintf(msg, sizeof(msg), "  [%d] %s\r\n", aes_file_count + 1, file_list[i]);
          Serial_PutString((uint8_t *)msg);
          aes_file_count++;
        }
      }
    }

