Lingjia007/STM32F407_Bootloader/IAP/menu.c
    if (aes_file_count == 0)
    {
      Serial_PutString((uint8_t *)"No .bin.aes files found on SD card!\r\n");
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }

    BuildSelectionPrompt(msg, sizeof(msg), aes_file_count, "\r\nPlease select a file to decrypt and download");
    Serial_PutString((uint8_t *)msg);

    __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

    while (1)
    {
      HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

      if (key == 'a' || key == 'A')
      {
        Serial_PutString((uint8_t *)"\r\nAborted by user.\r\n");
        f_mount(NULL, (TCHAR const *)SDPath, 0);
        return;
      }

      if (key >= '1' && key <= '9')
      {
        selected = key - '0';
        if (selected >= 1 && selected <= aes_file_count)
        {
          break;
        }
      }
    }

    uint8_t aes_idx = 0;
    for (i = 0; i < file_count; i++)
    {
      size_t len = strlen(file_list[i]);
      if (len >= 8)
      {
        const char *ext = file_list[i] + len - 8;
        if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
        {
          aes_idx++;
          if (aes_idx == selected)
          {
            selected = i;
            break;
          }
        }
      }
    }

    snprintf(msg, sizeof(msg), "\r\nSelected: %s\r\n", file_list[selected]);
    Serial_PutString((uint8_t *)msg);

    snprintf(src_path, sizeof(src_path), "0:/%s", file_list[selected]);

    Serial_PutString((uint8_t *)"\r\nStarting decryption and download...\r\n");

    decrypt_result = aes_decrypt_to_flash_fatfs(&SDFatFS, src_path, APPLICATION_ADDRESS, &decrypt_config);

    if (decrypt_result > 0)
    {
      Serial_PutString((uint8_t *)"\r\nDecryption and download completed successfully!\r\n");
      snprintf(msg, sizeof(msg), "Written size: %d bytes\r\n", decrypt_result);
      Serial_PutString((uint8_t *)msg);
      Serial_PutString((uint8_t *)"You can now execute the application.\r\n");
    }
    else
    {
      Serial_PutString((uint8_t *)"\r\nDecryption failed! Error code: ");
      Int2Str((uint8_t *)msg, (uint32_t)(-decrypt_result));
      Serial_PutString((uint8_t *)msg);
      Serial_PutString((uint8_t *)"\r\n");
    }

    f_mount(NULL, (TCHAR const *)SDPath, 0);
    break;
  }

  case '2':
  {
    Serial_PutString((uint8_t *)"\r\nInitializing SPI Flash...\r\n");

    lfs_res = lfs_spi_flash_init();
    if (lfs_res != 0)
    {
      Serial_PutString((uint8_t *)"Error: SPI Flash initialization failed!\r\n");
      return;
    }

    Serial_PutString((uint8_t *)"Mounting LittleFS...\r\n");

    lfs_res = lfs_spi_flash_mount(&lfs);
    if (lfs_res != LFS_ERR_OK)
    {
      Serial_PutString((uint8_t *)"Error: LittleFS mount failed!\r\n");
      return;
    }

    Serial_PutString((uint8_t *)"Scanning for .bin.aes files...\r\n\r\n");

    scan_lfs_files(&lfs);

    uint8_t lfs_aes_file_count = 0;
    for (i = 0; i < file_count; i++)
    {
      size_t len = strlen(file_list[i]);
      if (len >= 8)
      {
        const char *ext = file_list[i] + len - 8;
        if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
        {
          snprintf(msg, sizeof(msg), "  [%d] %s\r\n", lfs_aes_file_count + 1, file_list[i]);
          Serial_PutString((uint8_t *)msg);
          lfs_aes_file_count++;
        }
      }
    }

    if (lfs_aes_file_count == 0)
    {
      Serial_PutString((uint8_t *)"No .bin.aes files found on SPI Flash!\r\n");
      lfs_spi_flash_unmount(&lfs);
      return;
    }

    BuildSelectionPrompt(msg, sizeof(msg), lfs_aes_file_count, "\r\nPlease select a file to decrypt and download");
    Serial_PutString((uint8_t *)msg);

    __HAL_UART_FLUSH_DRREGISTER(&UartHandle);

    while (1)
    {
      HAL_UART_Receive(&UartHandle, &key, 1, RX_TIMEOUT);

      if (key == 'a' || key == 'A')
      {
        Serial_PutString((uint8_t *)"\r\nAborted by user.\r\n");
        lfs_spi_flash_unmount(&lfs);
        return;
      }

      if (key >= '1' && key <= '9')
      {
        selected = key - '0';
        if (selected >= 1 && selected <= lfs_aes_file_count)
        {
          break;
        }
      }
    }

    uint8_t lfs_aes_idx = 0;
    for (i = 0; i < file_count; i++)
    {
      size_t len = strlen(file_list[i]);
      if (len >= 8)
      {
        const char *ext = file_list[i] + len - 8;
        if (strcmp(ext, ".bin.aes") == 0 || strcmp(ext, ".BIN.AES") == 0)
        {
          lfs_aes_idx++;
          if (lfs_aes_idx == selected)
          {
            selected = i;
            break;
          }
        }
      }
    }

    snprintf(msg, sizeof(msg), "\r\nSelected: %s\r\n", file_list[selected]);
    Serial_PutString((uint8_t *)msg);

    Serial_PutString((uint8_t *)"\r\nStarting decryption and download...\r\n");

    decrypt_result = aes_decrypt_to_flash_lfs(&lfs, file_list[selected], APPLICATION_ADDRESS, &decrypt_config);

    if (decrypt_result > 0)
    {
      Serial_PutString((uint8_t *)"\r\nDecryption and download completed successfully!\r\n");
      snprintf(msg, sizeof(msg), "Written size: %d bytes\r\n", decrypt_result);
      Serial_PutString((uint8_t *)msg);
      Serial_PutString((uint8_t *)"You can now execute the application.\r\n");
    }
    else
    {
      Serial_PutString((uint8_t *)"\r\nDecryption failed! Error code: ");
      Int2Str((uint8_t *)msg, (uint32_t)(-decrypt_result));
      Serial_PutString((uint8_t *)msg);
      Serial_PutString((uint8_t *)"\r\n");
    }

    lfs_spi_flash_unmount(&lfs);
    break;
  }

  default:
    Serial_PutString((uint8_t *)"Invalid Number ! ==> The number should be 0, 1 or 2\r");
    break;
  }
}

/**
 * @}
 */
